In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import json
from pprint import pprint

In [2]:
with open('../../../student-life-dataset/dataset/EMA/EMA_definition.json') as f:
    definitions = json.load(f)

# Social

In [3]:
definitions[0]

{'name': 'Social',
 'questions': [{'options': '[1]0-4 persons, [2]5-9 persons, [3]10-19 persons, [4]20-49 persons, [5]50-99 persons, [6]over 100 persons, ',
   'question_id': 'number',
   'question_text': 'How many people did you have contact with yesterday, including anyone you said hello to, chatted, talked or discussed matters with, whether you did it face-to-face, by telephone, by mail or on the internet, and whether you personally knew the person or not? Please select one of the following categories that best matches your estimate:'},
  {'options': '', 'question_id': 'location', 'question_text': ''}]}

In [43]:
social = pd.read_json('../../../student-life-dataset/dataset/EMA/response/Social/Social_u00.json')

In [46]:
social.head(10)

,location,null,number,resp_time
0,NaN,"43.75908069,-72.32885314",NaN,2013-03-24 08:39:53
1,NaN,"43.75908069,-72.32885314",NaN,2013-03-24 08:40:55
2,NaN,4,NaN,2013-03-24 08:39:50
3,NaN,3,NaN,2013-03-25 02:16:15
4,NaN,"43.75885953,-72.32939114",NaN,2013-03-24 22:11:35
5,Unknown,NaN,5.0,2013-03-26 02:21:23
6,"43.70759062,-72.28510298",NaN,1.0,2013-03-26 22:51:41
7,"43.70697406,-72.28758978",NaN,1.0,2013-03-26 20:13:18
8,"43.70708859,-72.28753397",NaN,3.0,2013-04-03 21:16:37
9,"43.70863158,-72.2842741",NaN,4.0,2013-03-27 23:09:03

In [47]:
social = social.drop(columns='null')

In [48]:
social = social.dropna(subset=['number'])

In [9]:
# for i in range(social.shape[0]):
#     if pd.isnull(social.iloc[i, 1]) == False:
#         if (',' in social.iloc[i, 1]):
#             social.iloc[i, 0] = social.iloc[i, 1]
#         else:
#             social.iloc[i, 2] = social.iloc[i, 1]

In [49]:
social.head()

                   location  number           resp_time
5                   Unknown     5.0 2013-03-26 02:21:23
6  43.70759062,-72.28510298     1.0 2013-03-26 22:51:41
7  43.70697406,-72.28758978     1.0 2013-03-26 20:13:18
8  43.70708859,-72.28753397     3.0 2013-04-03 21:16:37
9   43.70863158,-72.2842741     4.0 2013-03-27 23:09:03

# Class 1

In [50]:
definitions[1]

{'name': 'Class',
 'questions': [{'options': '',
   'question_id': 'course_id',
   'question_text': "What's the class name? (e.g., CS65)"},
  {'options': '[1]neutral, [2]strongly agree, [3]agree, [4]disagree, [5]strongly disagree, ',
   'question_id': 'experience',
   'question_text': 'I enjoyed the class today.'},
  {'options': '[1]0, [2]1, [3]2, [4]3, [5]4, [6]5, [7]6, [8]7, [9]8, [10]9, [11]10, [12]>10, ',
   'question_id': 'hours',
   'question_text': 'How many hours did you spent on coursework outside class since the last class?'},
  {'options': '(Yes) 1 2 (No)',
   'question_id': 'due',
   'question_text': 'Do you have an assignment (due), quizz or exam today?'},
  {'options': '', 'question_id': 'location', 'question_text': ''}]}

In [54]:
class1 = pd.read_json('../../../student-life-dataset/dataset/EMA/response/Class/Class_u00.json')
class1.head(10)

,course_id,due,experience,hours,location,null,resp_time
0,NaN,NaN,NaN,NaN,NaN,"43.75926962,-72.32909769",2013-03-24 08:34:42
1,NaN,NaN,NaN,NaN,NaN,,2013-03-24 08:40:48
2,,2.0,1.0,1.0,"43.76243366,-72.32615434",NaN,2013-04-01 01:25:48
3,cs65\n,2.0,3.0,1.0,"43.70544533,-72.28679012",NaN,2013-03-26 04:26:33
4,,1.0,1.0,1.0,"43.75932116,-72.32890406",NaN,2013-03-27 04:07:51
5,cs65,2.0,2.0,1.0,"43.70033175,-72.28949659",NaN,2013-03-28 22:19:40
6,c65,2.0,3.0,2.0,"43.70465788,-72.2887224",NaN,2013-03-28 00:10:26
7,cs65,2.0,3.0,2.0,"43.70688502,-72.28755706",NaN,2013-03-29 00:26:11
8,cs65,2.0,3.0,1.0,"43.70777831,-72.28510534",NaN,2013-03-29 19:02:07
9,cs66,2.0,3.0,3.0,"43.70587194,-72.28717655",NaN,2013-03-30 00:06:02

In [55]:
class1 = class1.drop(columns='null')

In [56]:
class1 = class1.dropna(subset=['due', 'experience', 'hours'])

In [57]:
class1.head()

,course_id,due,experience,hours,location,resp_time
2,,2.0,1.0,1.0,"43.76243366,-72.32615434",2013-04-01 01:25:48
3,cs65\n,2.0,3.0,1.0,"43.70544533,-72.28679012",2013-03-26 04:26:33
4,,1.0,1.0,1.0,"43.75932116,-72.32890406",2013-03-27 04:07:51
5,cs65,2.0,2.0,1.0,"43.70033175,-72.28949659",2013-03-28 22:19:40
6,c65,2.0,3.0,2.0,"43.70465788,-72.2887224",2013-03-28 00:10:26

# Stress

In [58]:
definitions[3]

{'name': 'Stress',
 'questions': [{'options': '[1]A little stressed, [2]Definitely stressed, [3]Stressed out, [4]Feeling good, [5]Feeling great, ',
   'question_id': 'level',
   'question_text': 'Right now, I am...'},
  {'options': '', 'question_id': 'location', 'question_text': ''}]}

In [59]:
stress = pd.read_json('../../../student-life-dataset/dataset/EMA/response/Stress/Stress_u00.json')

In [60]:
stress.head(10)

,level,location,null,resp_time
0,NaN,NaN,"43.75908069,-72.32885314",2013-03-24 08:40:01
1,NaN,NaN,"43.75908069,-72.32885314",2013-03-24 08:40:58
2,NaN,NaN,"43.70677151,-72.28746626",2013-03-25 02:16:45
3,NaN,NaN,1,2013-03-25 00:00:18
4,NaN,NaN,1,2013-03-25 02:16:49
5,2.0,"43.70692415,-72.2873929",NaN,2013-03-25 18:54:56
6,2.0,"43.70555193,-72.28704778",NaN,2013-03-26 03:33:26
7,2.0,"43.70555193,-72.28704778",NaN,2013-03-26 03:33:34
8,1.0,"43.70678675,-72.28732051",NaN,2013-03-27 01:12:20
9,4.0,"43.70032217,-72.28941584",NaN,2013-03-28 22:19:12

In [61]:
stress = stress.drop(columns='null')
stress = stress.dropna(subset=['level'])

In [62]:
stress.head()

   level                  location           resp_time
5    2.0   43.70692415,-72.2873929 2013-03-25 18:54:56
6    2.0  43.70555193,-72.28704778 2013-03-26 03:33:26
7    2.0  43.70555193,-72.28704778 2013-03-26 03:33:34
8    1.0  43.70678675,-72.28732051 2013-03-27 01:12:20
9    4.0  43.70032217,-72.28941584 2013-03-28 22:19:12

# Sleep

In [63]:
definitions[4]

{'name': 'Sleep',
 'questions': [{'options': '[1]<3, [2]3.5, [3]4, [4]4.5, [5]5, [6]5.5, [7]6, [8]6.5, [9]7, [10]7.5, [11]8, [12]8.5, [13]9, [14]9.5, [15]10, [16]10.5, [17]11, [18]11.5, [19]12, ',
   'question_id': 'hour',
   'question_text': 'How many hours did you sleep last night? '},
  {'options': '[1]Very good, [2]Fairly good, [3]Fairly bad, [4]Very bad, ',
   'question_id': 'rate',
   'question_text': 'How would rate your overall sleep last night?'},
  {'options': '[1]None, [2]Once, [3]Twice, [4]Three or more times, ',
   'question_id': 'social',
   'question_text': 'How often did you have trouble staying awake yesterday while in class, eating meals or engaging in social activity?'},
  {'options': '', 'question_id': 'location', 'question_text': ''}]}

In [64]:
sleep = pd.read_json('../../../student-life-dataset/dataset/EMA/response/Sleep/Sleep_u00.json')

In [67]:
sleep.head(10)

,hour,location,null,rate,resp_time,social
0,NaN,NaN,"43.75908069,-72.32885314",NaN,2013-03-24 08:46:00,NaN
1,NaN,NaN,8,NaN,2013-03-24 08:46:05,NaN
2,NaN,NaN,1,NaN,2013-03-24 08:40:53,NaN
3,NaN,NaN,1,NaN,2013-03-24 08:46:15,NaN
4,NaN,NaN,3,NaN,2013-03-24 08:39:25,NaN
5,NaN,NaN,8,NaN,2013-03-24 08:46:01,NaN
6,NaN,NaN,8,NaN,2013-03-24 08:46:11,NaN
7,NaN,NaN,"43.75885953,-72.32939114",NaN,2013-03-24 18:07:40,NaN
8,8.0,"43.70692415,-72.2873929",NaN,1.0,2013-03-25 18:54:36,1.0
9,5.0,"43.70708859,-72.28753397",NaN,3.0,2013-04-03 17:27:27,2.0

In [68]:
sleep = sleep.drop(columns='null')
sleep = sleep.dropna(subset=['hour'])

In [69]:
sleep.head()

    hour                  location  rate           resp_time  social
8    8.0   43.70692415,-72.2873929   1.0 2013-03-25 18:54:36     1.0
9    5.0  43.70708859,-72.28753397   3.0 2013-04-03 17:27:27     2.0
10   8.0  43.70759062,-72.28510298   1.0 2013-03-26 21:46:45     1.0
11   7.0  43.70393682,-72.30152284   2.0 2013-03-26 18:07:14     1.0
12   8.0  43.75932116,-72.32890406   3.0 2013-03-27 04:09:49     1.0

# Activity

In [70]:
definitions[5]

{'name': 'Activity',
 'questions': [{'options': '[1]0-10%, [2]11-25%, [3]26-50%, [4]51-75%, [5]76-100%, ',
   'question_id': 'working',
   'question_text': 'alone working'},
  {'options': '[1]0-10%, [2]11-25%, [3]26-50%, [4]51-75%, [5]76-100%, ',
   'question_id': 'relaxing',
   'question_text': 'alone relaxing'},
  {'options': '[1]0-10%, [2]11-25%, [3]26-50%, [4]51-75%, [5]76-100%, ',
   'question_id': 'other_working',
   'question_text': 'with other people working'},
  {'options': '[1]0-10%, [2]11-25%, [3]26-50%, [4]51-75%, [5]76-100%, ',
   'question_id': 'other_relaxing',
   'question_text': 'with other people relaxing'},
  {'options': '', 'question_id': 'location', 'question_text': 'location'}]}

In [90]:
activity = pd.read_json('../../../student-life-dataset/dataset/EMA/response/Activity/Activity_u04.json')

In [92]:
activity = activity.drop(columns=['null', 'Social2'])

In [93]:
activity.head()

,location,other_relaxing,other_working,relaxing,resp_time,working
0,NaN,NaN,NaN,NaN,2013-04-03 16:45:45,NaN
1,NaN,NaN,NaN,NaN,2013-03-27 01:10:09,NaN
2,NaN,NaN,NaN,NaN,2013-03-27 15:16:12,NaN
3,NaN,NaN,NaN,NaN,2013-03-30 22:35:47,NaN
4,NaN,NaN,NaN,NaN,2013-04-02 06:36:32,NaN

# Behavior

In [94]:
definitions[6]

{'name': 'Behavior',
 'questions': [{'options': '(Not at all) 1 2 3 4 5 (Extremely)',
   'question_id': 'enthusiastic',
   'question_text': 'In the past 15 minutes, I was extraverted, enthusiastic.                (Scale: 1=Not at all; 2=A little; 3=somewhat; 4=very; 5=extremely)'},
  {'options': '(Not at all) 1 2 3 4 5 (Extremely)',
   'question_id': 'critical',
   'question_text': '......, I was critical, quarrelsome.'},
  {'options': '(Not at all) 1 2 3 4 5 (Extremely)',
   'question_id': 'dependable',
   'question_text': '......, I was dependable, self-disciplined.'},
  {'options': '(Not at all) 1 2 3 4 5 (Extremely)',
   'question_id': 'anxious',
   'question_text': '......, I was anxious, easily upset.'},
  {'options': '(Not at all) 1 2 3 4 5 (Extremely)',
   'question_id': 'experiences',
   'question_text': '......, I was open to new experiences, complex.'},
  {'options': '(Not at all) 1 2 3 4 5 (Extremely)',
   'question_id': 'reserved',
   'question_text': '......, I was reserved, quiet.'},
  {'options': '(Not at all) 1 2 3 4 5 (Extremely)',
   'question_id': 'sympathetic',
   'question_text': '......, I was sympathetic, warm.'},
  {'options': '(Not at all) 1 2 3 4 5 (Extremely)',
   'question_id': 'disorganized',
   'question_text': '......,  I was disorganized, careless.'},
  {'options': '(Not at all) 1 2 3 4 5 (Extremely)',
   'question_id': 'calm',
   'question_text': '......, I was calm, emotionally stable.'},
  {'options': '(Not at all) 1 2 3 4 5 (Extremely)',
   'question_id': 'conventional',
   'question_text': '......, I was conventional, uncreative.'},
  {'options': '', 'question_id': 'location', 'question_text': 'location'}]}

In [95]:
behavior = pd.read_json('../../../student-life-dataset/dataset/EMA/response/Behavior/Behavior_u00.json')

In [97]:
behavior.head(15)

,anxious,calm,conventional,critical,dependable,disorganized,enthusiastic,experiences,location,null,reserved,resp_time,sympathetic
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3,NaN,2013-03-27 08:13:34,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,null,NaN,2013-03-27 10:25:48,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3,NaN,2013-03-28 02:24:38,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3,NaN,2013-03-29 16:05:43,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,5,NaN,2013-04-04 00:29:00,NaN
5,4.0,4,5,2.0,3,3,4,4,NaN,NaN,3,2013-04-08 21:04:28,4
6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3,NaN,2013-04-07 21:01:46,NaN
7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,4,NaN,2013-04-05 20:36:51,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3,NaN,2013-04-06 21:28:01,NaN
9,5.0,3,3,1.0,4,4,4,3,NaN,NaN,1,2013-04-10 19:19:47,4
10,4.0,3,3,3.0,4,2,4,4,NaN,NaN,2,2013-04-16 20:58:39,4
11,4.0,5,2,1.0,4,3,5,3,NaN,NaN,1,2013-04-17 20:17:57,4
12,3.0,3,3,3.0,3,3,3,4,NaN,"43.70082504,-72.28929272",3,2013-04-22 20:42:22,4
13,5.0,3,4,5.0,3,4,2,1,NaN,"43.759114,-72.32922421",3,2013-04-25 05:26:27,4
14,5.0,3,4,2.0,5,1,4,3,"43.7029479,-72.28940835",NaN,1,2013-04-26 20:41:51,3

In [99]:
behavior = behavior.drop(columns=['null'])

In [100]:
behavior.head()

,anxious,calm,conventional,critical,dependable,disorganized,enthusiastic,experiences,location,reserved,resp_time,sympathetic
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2013-03-27 08:13:34,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2013-03-27 10:25:48,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2013-03-28 02:24:38,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2013-03-29 16:05:43,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2013-04-04 00:29:00,NaN

# Exercise

In [101]:
definitions[7]

{'name': 'Exercise',
 'questions': [{'options': '(Yes) 1 2 (No)',
   'question_id': 'have',
   'question_text': "Did you do vigorous exercise today (don't include walking) such as run, swim, cycle, play a sport"},
  {'options': '(Yes) 1 2 (No)',
   'question_id': 'schedule',
   'question_text': "If no did you want to but couldn't because of your schedule?"},
  {'options': '[1]None, [2]<30 mins, [3]30-60 mins, [4]60-90 mins, [5]>90mins, ',
   'question_id': 'exercise',
   'question_text': 'If you exercised how long did you exercise for?'},
  {'options': '', 'question_id': 'location', 'question_text': ''},
  {'options': '[1]None, [2]<30 mins, [3]30-60 mins, [4]60-90 mins, [5]>90mins, ',
   'question_id': 'walk',
   'question_text': 'How long did you walk for today?'}]}

In [108]:
exercise = pd.read_json('../../../student-life-dataset/dataset/EMA/response/Exercise/Exercise_u00.json')
exercise.head(10)

   exercise have location           resp_time schedule  walk
0         4    1      NaN 2013-04-03 03:43:26     null     2
1         3    2      NaN 2013-04-01 14:55:38        1     2
2         1    2      NaN 2013-04-01 17:12:56        1     1
3         1    1      NaN 2013-04-02 04:03:53     null     1
4         1    2      NaN 2013-04-04 00:28:03        1     2
5         1    2      NaN 2013-04-04 02:03:44        1     3
6         1    2      NaN 2013-04-06 02:19:21        1     1
7         4    1      NaN 2013-04-05 02:39:51        2     3
8         4    1      NaN 2013-04-05 20:37:51     null     3
9         3    2      NaN 2013-04-07 18:35:08        2     3

# Study Spaces

In [109]:
definitions[8]

{'name': 'Study Spaces',
 'questions': [{'options': '',
   'question_id': 'place',
   'question_text': 'Where were you working (room and building)?'},
  {'options': '[1]super distracted, [2]mildly distracted, [3]mildly productive, [4]super productive, ',
   'question_id': 'productivity',
   'question_text': 'Rate your productivity:'},
  {'options': '[1]silent, [2]white noise, [3]loud, [4]distracting, ',
   'question_id': 'noise',
   'question_text': 'What was the ambient noise level?'},
  {'options': '', 'question_id': 'location', 'question_text': ''}]}

In [111]:
study_spaces = pd.read_json('../../../student-life-dataset/dataset/EMA/response/Study Spaces/Study Spaces_u00.json')
study_spaces.head(10)

,location,noise,null,place,productivity,resp_time
0,"43.75872078,-72.32869187",NaN,1.0,sudi,3,2013-04-19 04:30:13
1,"43.70806183,-72.28452186",NaN,1.0,king Arthur cafe\n,4,2013-04-19 23:00:55
2,"43.71472383,-72.30880637",NaN,1.0,library,3,2013-04-21 04:51:56
3,"43.75957917,-72.32886943",NaN,2.0,homr,2,2013-04-22 00:17:04
4,"43.70381516,-72.28813609",NaN,1.0,nowhere,1,2013-04-24 04:06:22
5,"43.70411717,-72.2890889",NaN,4.0,sukdicoff room 319,1,2013-04-23 04:01:10
6,"43.70863122,-72.28437025",1.0,NaN,office,3,2013-04-29 22:53:36
7,Unknown,3.0,NaN,home,2,2013-04-28 23:36:59
8,Unknown,3.0,NaN,pub,2,2013-05-03 23:43:41
9,"48.84434287,2.3817956",3.0,NaN,nowhere,1,2013-05-05 19:54:43

In [112]:
study_spaces = study_spaces.drop(columns=['null', 'place'])

In [113]:
study_spaces.head()

                   location  noise  productivity           resp_time
0  43.75872078,-72.32869187    NaN             3 2013-04-19 04:30:13
1  43.70806183,-72.28452186    NaN             4 2013-04-19 23:00:55
2  43.71472383,-72.30880637    NaN             3 2013-04-21 04:51:56
3  43.75957917,-72.32886943    NaN             2 2013-04-22 00:17:04
4  43.70381516,-72.28813609    NaN             1 2013-04-24 04:06:22

# Events

In [114]:
definitions[10]

{'name': 'Events',
 'questions': [{'options': '[1]1, [2]2, [3]3, [4]4, [5]5, [6]6, [7]7, ',
   'question_id': 'positive',
   'question_text': "Think About Yesterday's Events. Rate the intensity of your Most Positive Events on a scale ranging from 1 (very weak)  to 7 (very intense)."},
  {'options': '[1]1, [2]2, [3]3, [4]4, [5]5, [6]6, [7]7, ',
   'question_id': 'negative',
   'question_text': 'Rate the intensity of your Most Negative Events on a scale.'},
  {'options': '',
   'question_id': 'pevent',
   'question_text': 'What was the positive event (single word or short comment)?'},
  {'options': '',
   'question_id': 'nevent',
   'question_text': 'What was the negative event?'},
  {'options': '', 'question_id': 'location', 'question_text': ''}]}

In [115]:
events = pd.read_json('../../../student-life-dataset/dataset/EMA/response/Events/Events_u10.json')
events.head(10)

,location,negative,nevent,pevent,positive,resp_time
0,"43.70665284,-72.28802865",5,f,birrhday,5,2013-04-19 17:56:04
1,"43.70324408,-72.28961597",7,90 on the lab,successful crawler function,5,2013-04-25 01:22:19
2,"43.70324408,-72.28961597",3,,dinner,3,2013-04-23 01:58:20
3,"43.70151131,-72.28813703",4,cs65 lab,fixed bug in crawler,4,2013-04-28 04:07:16
4,"43.70330372,-72.2898598",3,discovered bug in crawler,built crawler,4,2013-04-26 07:10:25
5,"43.70412157,-72.28527572",1,,,1,2013-05-01 16:27:32
6,"43.70452075,-72.28559555",1,none,finished lab,4,2013-05-04 16:29:24
7,Unknown,1,,,1,2013-05-21 18:59:59
8,Unknown,1,,,1,2013-05-23 19:03:55

In [116]:
events = events.drop(columns=['nevent', 'pevent'])

In [117]:
events.head()

                   location  negative  positive           resp_time
0  43.70665284,-72.28802865         5         5 2013-04-19 17:56:04
1  43.70324408,-72.28961597         7         5 2013-04-25 01:22:19
2  43.70324408,-72.28961597         3         3 2013-04-23 01:58:20
3  43.70151131,-72.28813703         4         4 2013-04-28 04:07:16
4   43.70330372,-72.2898598         3         4 2013-04-26 07:10:25

# Mood

In [118]:
definitions[16]

{'name': 'Mood',
 'questions': [{'options': '(Yes) 1 2 (No)',
   'question_id': 'happyornot',
   'question_text': 'Do you feel AT ALL happy right now?'},
  {'options': '[1]a little bit, [2]somewhat, [3]very much, [4]extremely, ',
   'question_id': 'happy',
   'question_text': 'If you answered "Yes" on the first question, how happy do you feel? '},
  {'options': '(Yes) 1 2 (No)',
   'question_id': 'sadornot',
   'question_text': 'Do you feel AT ALL sad right now? '},
  {'options': '[1]a little bit, [2]somewhat, [3]very much, [4]extremely, ',
   'question_id': 'sad',
   'question_text': 'If you answered "Yes" on the third question, how sad do you feel?'},
  {'options': '', 'question_id': 'location', 'question_text': ''}]}

In [119]:
mood = pd.read_json('../../../student-life-dataset/dataset/EMA/response/Mood/Mood_u00.json')
mood.head(10)

,happy,happyornot,location,resp_time,sad,sadornot
0,1,2,"43.75921839,-72.32919741",2013-04-25 06:09:55,3,1
1,2,1,Unknown,2013-04-25 02:40:33,4,1
2,2,1,"43.71332016,-72.30876457",2013-05-16 15:43:07,1,1
3,3,1,"43.75880824,-72.32925862",2013-05-15 15:24:22,1,2
4,2,1,"43.75929012,-72.32904032",2013-05-17 14:59:10,1,null
5,1,null,"43.75906255,-72.32936718",2013-05-21 02:41:36,1,null
6,1,2,"43.70685166,-72.28720734",2013-05-22 03:57:58,1,2
7,1,1,"43.7065519,-72.28701015",2013-05-23 02:40:11,1,1
8,1,null,"43.70206745,-72.2892032",2013-08-07 01:47:19,1,null
9,1,null,"43.70579481,-72.28577693",2013-08-10 03:44:09,1,null

# Mood 2

In [120]:
definitions[17]

{'name': 'Mood 2',
 'questions': [{'options': '[1]happy, [2]stressed, [3]tired, ',
   'question_id': 'how',
   'question_text': 'How are you right now?'},
  {'options': '', 'question_id': 'location', 'question_text': ''}]}

In [121]:
mood2 = pd.read_json('../../../student-life-dataset/dataset/EMA/response/Mood 2/Mood 2_u00.json')
mood2.head(10)

   how                  location           resp_time
0    1    48.84738024,2.33970511 2013-05-05 19:54:43
1    3  43.70511209,-72.28803398 2013-05-11 00:11:07
2    1  43.75921991,-72.32879322 2013-05-12 00:02:17
3    1  43.70587062,-72.28704848 2013-05-14 00:18:42
4    1  43.75887815,-72.32893078 2013-05-13 00:43:25
5    1  43.75923897,-72.32921506 2013-05-19 19:56:38
6    3                   Unknown 2013-05-20 00:13:13
7    1  43.70001843,-72.28930482 2013-05-23 00:14:06
8    1  43.70659363,-72.28727549 2013-05-28 00:15:46
9    1   38.8547716,-77.04399257 2013-05-26 00:00:45

# Mood 1

In [122]:
definitions[20]

{'name': 'Mood 1',
 'questions': [{'options': '[1]happy, [2]stressed, [3]tired, ',
   'question_id': 'tomorrow',
   'question_text': 'How do you think you will be this time tomorrow?'},
  {'options': '', 'question_id': 'location', 'question_text': ''}]}

In [123]:
mood1 = pd.read_json('../../../student-life-dataset/dataset/EMA/response/Mood 1/Mood 1_u00.json')
mood1.head(10)

                   location           resp_time  tomorrow
0   43.7069422,-72.28679881 2013-04-25 23:08:25         2
1  43.70674491,-72.28743434 2013-05-01 02:49:06         3
2  43.66395962,-72.24163402 2013-05-03 23:43:38         1
3                   Unknown 2013-05-03 23:43:41         1
4                   Unknown 2013-05-30 05:14:47         1
5  43.75915222,-72.32954385 2013-05-28 05:43:57         1
6  43.75929059,-72.32919777 2013-05-27 04:38:12         1
7  43.70434788,-72.28657033 2013-05-29 04:51:57         1
8  43.70647159,-72.28748884 2013-05-31 04:58:43         1
9  43.75936117,-72.32975719 2013-06-02 04:54:12         1

# Class 2

In [124]:
definitions[21]

{'name': 'Class 2',
 'questions': [{'options': '[1]Agree Strongly, [2]Agree Moderately, [3]Agree Slightly, [4]Disagree Slightly , [5]Disagree Moderately, [6]Disagree Strongly, ',
   'question_id': 'challenge',
   'question_text': "Last week's lab was difficult and challenged me."},
  {'options': '[1]Agree Strongly, [2]Agree Moderately, [3]Agree Slightly, [4]Disagree Slightly , [5]Disagree Moderately, [6]Disagree Strongly, ',
   'question_id': 'effort',
   'question_text': 'I put a great deal of effort into the course last week.'},
  {'options': '[1]A, [2]A-, [3]B+, [4]B, [5]B-, [6]C+, [7]C, [8]C-, ',
   'question_id': 'grade',
   'question_text': 'I expect to get the following grade for this course.'},
  {'options': '', 'question_id': 'location', 'question_text': ''}]}

In [125]:
class2 = pd.read_json('../../../student-life-dataset/dataset/EMA/response/Class 2/Class 2_u00.json')
class2.head(10)

   challenge  effort  grade                  location           resp_time
0          1       1      4  43.75924116,-72.32919107 2013-04-25 06:12:47
1          3       4      5    48.88597611,2.34306365 2013-05-06 16:51:50
2          1       1      1  43.75930193,-72.32937522 2013-05-20 00:16:11